Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རིག་པ་ཅན་རྣམས་དགའ་བར་འགྱུར་བའོ། །
en: and delighting the knowledgeable.

source: སྨྲ་འདོད་པ་རྣམས་ཀྱི་སྤྱོད་པའི་རྒྱུའོ། །
en: It is the cause of action for those wishing to teach,

source: ཆོས་སྟོན་པ་རྣམས་བསྲུང་བའོ། །
en: the protector of those who teach the Dharma,

source: རྒྱུ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པའོ། །
en: knowledge of all causes,

source: ཆོས་ཐམས་ཅད་ལ་ཐབས་མཁས་པའོ། །
en: and skill in means regarding all phenomena.

source: རྟོག་པའི་ཐབས་གྲུབ་པའོ། །
en: It is accomplishing the means for contemplation,

source: དེ་ཁོ་ན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་མཐོང་བའོ། །
en: seeing in accord with reality,

source: བདག་ལ་བརྡ་སྤྲོད་པའོ། །
en: conveying meaning to oneself,

source: གཞན་དག་ཡང་དག་པར་ཚིམ་པར་བྱེད་པའོ། །
en: truly satisfying others,

source: དྲ་བ་གཅོད་པའོ། །
en: cutting through the mesh,

source: མ་རིག་པ་སེལ་བའོ། །
en: and dispelling ignorance.

source: ཕུང་པོ་རྣམས་ཡོངས་སུ་ཤེས་པའོ། །
en: It is understanding the aggregates,

source: རྣམ་པར་ཤེས་པ་ཡོངས་སུ་ཤེས་པའོ། །
en: understanding consciousness,

source: མིང་དང་གཟུགས་སྡུད་པའོ། །
en: comprehending name and form,

source: སྐྱེ་མཆེད་དྲུག་མཐོང་བའོ། །
en: seeing the six sense sources,

source: རེག་པ་ཡོངས་སུ་ཤེས་པའོ། །
en: understanding contact,

source: ཚོར་བ་ཤེས་པའོ། །
en: knowing sensation,

source: སྲེད་པ་རབ་ཏུ་ཞི་བར་བྱེད་པའོ། །
en: quelling craving,

source: ཉེ་བར་ལེན་པ་བོར་བའོ། །
en: giving up grasping,

source: སྲིད་པ་ཆད་པའོ། །
en: halting becoming,

source: སྐྱེ་བ་ཆོམས་པའོ། །
en: uprooting birth,

source: རྒ་ཤི་ལས་འདས་པའོ། །
en: and transcending old age and death.

source: སྡུག་བསྔལ་ཤིན་ཏུ་སྦྱངས་པའོ། །
en: It is the purification of suffering,

source: བདེ་བ་ལ་ཀུན་ཏུ་རངས་པའོ། །
en: rejoicing in happiness,

source: སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་རྣམ་པར་སེལ་བའོ། །
en: dispelling suffering and unhappiness,

source: གྲུབ་པ་རྣམས་གནས་པར་སྦྱོར་བའོ། །
en: attaining the accomplishments,

source: དཔྱོད་པ་རྣམས་ཚིམ་པར་བྱེད་པའོ། །
en: satisfying the discerning,

source: སྣང་བ་སྐྱོན་མེད་པའོ། །
en: flawless light,

source: ཆོས་ཀྱི་རྗེས་སུ་བསྒྲགས་པའོ། །
en: and proclamations in accord with the Dharma.

source: སྐྱེས་བུ་གྲགས་པ་ཅན་རྣམས་ཀྱི་མཐུ་རྩལ་ལོ། །
en: It is the power of beings who have gained fame,

source: འབྱུང་པོ་དྲི་མ་ཅན་རྣམས་འཁྲུ་བའོ། །
en: the cleansing of those who are stained,

source: འཇིག་ཚོགས་ལ་ལྟ་བ་རྣམས་ངེས་པར་འཇོམས་པའོ། །
en: and overcoming the view that takes the aggregates to be a person.

source: ཐོས་པ་ཀུན་ཏུ་འཛིན་པའོ། །
en: “It is retaining what is heard

source: ཆོས་རྣམས་ཀུན་ཏུ་འཛིན་པའོ། །
en: and retaining the teachings of the Dharma.

source: བྱང་ཆུབ་འཁྲུལ་པ་མེད་པ་ཉིད་དོ། །
en: It is unmistaken awakening,

source: དགེ་བ་ཐམས་ཅད་ལ་འཇུག་པ་མི་ལྡོག་པའོ། །
en: unceasing engagement with virtuous factors,

source: དགེ་བ་ཕལ་ཆེར་བསགས་པའོ། །
en: vast accumulations of virtue,

source: བློ་བསྒྲུབ་པའི་གཞིའོ། །
en: the basis for attaining wisdom,

source: བརྩོན་པ་དང་ལྡན་པ་རྣམས་ཀྱི་ཆོས་ཀྱི་ཚུལ་ལོ། །
en: the Dharma way of the diligent,

source: འཕགས་པའི་དགེ་འདུན་འཕེལ་བར་བྱེད་པའོ། །
en: expanding the saṅgha of noble beings,

source: ཕས་ཀྱི་རྒོལ་བ་རྣམས་ཚར་གཅོད་པའོ། །
en: eliminating the criticism of others,

source: ཆོས་སྨྲ་བ་རྣམས་ལ་ལེགས་སོ་ཞེས་བརྗོད་པའོ། །
en: approving of those who teach the Dharma,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པའོ། །
en: and the conduct of bodhisattvas.

source: རྩེད་མོ་འདོད་པ་རྣམས་ཀྱི་ཟླ་བའོ། །
en: It is the moon for those wishing to play,

source: ལས་ཀྱི་མཐའ་དོན་དུ་གཉེར་བ་རྣམས་ཀྱི་ཉི་མའོ། །
en: the sun for those who pursue livelihood,

source: སློབ་པར་འདོད་པ་རྣམས་ཀྱི་བསྟན་བཅོས་སོ། །
en: the treatise for those wishing to train,

source: ཕུ་དུད་དང་བཅས་པ་རྣམས་ཀྱི་རྒྱལ་པོའོ། །
en: the king of those who are respected,

source: མཁས་པ་རྣམས་ཀྱི་འདྲེན་པའོ། །
en: the guide of the learned,

source: ཆོས་དཀར་པོ་རྣམས་ཀྱི་ས་བོན་ནོ། །
en: the seed of virtuous factors,

source: རྣམ་པར་སྨིན་པའི་འབྲས་བུའི་བདུད་རྩིའོ། །
en: the nectar of the ripened fruit,

source: སྐྱེ་བ་དྲན་པའི་གཞིའོ། །
en: the basis for recollecting births,

source: སྐྱེ་བ་རབ་ཏུ་ཐོབ་པའོ། །
en: the attainment of birth,

source: བྱིས་པའི་ཆོས་རྣམས་ལ་སྨོད་པའོ། །
en: contempt for childish teachings,

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་ཡོན་ཏན་ཡང་དག་པའོ། །
en: the authentic qualities of the teachings of the thus-gone ones,

source: སྟོན་པ་དང་འཛིན་པ་རྣམ་པར་སྨིན་པ་མཐའ་ཡས་པའོ། །
en: and the infinite ripening of those who teach and uphold the Dharma.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གནས་སོ། །
en: It is a foundation of omniscience,

source: སྟོན་པ་ན་བདེ་འགྲོ་ཐོབ་པར་འགྱུར་བའོ། །
en: attainment of the higher realms in teaching,

source: ཡི་གེར་འདྲི་བ་ན་འཇིགས་པ་ཐམས་ཅད་སྤོང་བའོ། །
en: abandoning all fears in posing questions,

source: རྒལ་ནས་ཕྱིར་ལྡོག་པ་མེད་པའོ། །
en: never turning back when crossing over,

source: རྟོགས་པ་བརྗོད་པའི་གནས་སོ། །
en: and a foundation for expressing realization.

source: འཇིག་རྟེན་པ་ཐམས་ཅད་ཀྱི་བསྟན་པ་མནོས་པའོ། །
en: It is letting the entire world ponder the Dharma,

source: འདས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པའོ། །
en: the words of all the buddhas of the past,

source: ད་ལྟར་གྱི་སངས་རྒྱས་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་གཏེར་རོ། །
en: the treasure of the wisdom of all the buddhas of the present,

source: མ་འོངས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དགོངས་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །
en: and the perfection of the realization of all the buddhas of the future.

source: ཡང་དག་པའི་ཡེ་ཤེས་འཁྲུགས་པ་མེད་པ་མྱུར་དུ་འཐོབ་པར་འགྱུར་བའོ། །
en: “It is quickly attaining unshakable true wisdom,

source: སངས་རྒྱས་ཀྱི་ཕྱག་ལས་བྱུང་བའི་ཕྱག་རྒྱའོ། །
en: the seal that emerges from the Buddha’s hand,

source: སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཡོངས་སུ་དྲི་བར་འདུན་པ་ལ་ངོམས་པ་མེད་པའོ། །
en: and the insatiability of those who wish to ask about the Buddhadharma.

source: ཁོང་ཁྲོ་བའི་རྣམ་པར་རིག་པ་རབ་ཏུ་ཞི་བའོ། །
en: It is the quelling of aggressive cognitions,

source: ཐབས་མཁས་པ་རབ་ཏུ་ཐོབ་པའོ། །
en: the attainment of skillful means,

source: སའི་ཁམས་བསྒོམ་པའོ། །
en: cultivating the earth element,

source: ཆུའི་ཁམས་ལ་འཇུག་པའོ། །
en: engaging with the water element,

source: མེའི་ཁམས་ལ་སྙོམས་པར་འཇུག་པའོ། །
en: balancing the fire element,

source: རླུང་གི་ཁམས་ལ་གནས་པར་བྱེད་པའོ། །
en: stabilizing the wind element,

source: ནམ་མཁའི་ཁམས་རྣམ་པར་ཐར་པ་བསྒྲུབ་པའོ། །
en: and attaining liberation in the space element.

source: ཤེས་པའི་ཁམས་སྟོན་པར་བྱེད་པའོ། །
en: It is revealing the element of consciousness,

source: འདུས་བྱས་ལ་ཡིད་བྱུང་བའོ། །
en: dissatisfaction with conditioned factors,

source: བག་ལ་ཉལ་ཟློག་པའོ། །
en: bringing an end to latent tendencies,

source: ཁོང་ཁྲོ་བ་སེལ་བའོ། །
en: dispelling anger,

source: བཏང་སྙོམས་སུ་འདོར་བའོ། །
en: letting go in equanimity,

source: རང་གི་གནས་པ་ལ་མཁས་པའོ། །
en: skill regarding one’s own support,

source: གཞན་གྱི་གནས་པ་ལ་མཁས་པའོ། །
en: skill regarding the support of others,

source: བརྗོད་པ་འདོད་པ་རྣམས་ཀྱི་ཡི་གེའོ། །
en: and words for those wishing to speak.

source: བསྒྲུབ་པ་རྣམས་ལ་མངོན་པར་ཞེན་པ་མེད་པའོ། །
en: It is freedom from clinging to accomplishments,

source: ངར་འཛིན་པ་སྤོང་བའོ། །
en: relinquishing the idea of ‘I,’

source: ང་ཡིར་འཛིན་པ་འདོར་བའོ། །
en: relinquishing the idea of ‘mine,’

source: མོས་པ་བཟློག་པའི་གནས་སོ། །
en: the basis for reversing inclinations,

source: སེམས་འཇིག་པ་དང་བཅས་པའོ། །
en: a cautious mind,

source: སེམས་ཁྱི་དང་མཚུངས་པས་བསྟེན་པའོ། །
en: attending to the mind like a guard dog,

source: རྒྱ་ཆེ་བ་ལ་འཇུག་པའོ། །
en: entering the vast,

source: ཕྲ་བ་རྟོགས་པར་བྱེད་པའོ། །
en: and comprehending the subtle.

source: ངལ་བ་རྣམས་ཀྱི་གྲིབ་མའོ། །
en: “It is shade for the weary,

source: ཆུ་བོ་ལས་སྒྲོལ་བའོ། །
en: traversing the river,

source: ཕས་ཀྱི་རྒོལ་བ་རྣམས་ཀྱིས་མི་ཕྱེད་པའོ། །
en: being indomitable when under attack,

source: དེས་པ་རྣམས་ཀྱི་འཁར་བའོ། །
en: the staff of good people,

source: དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་བཀུར་བྱེད་པའོ། །
en: veneration for spiritual teachers,

source: རྨུགས་པ་དང་གཉིད་རྣམས་སྤོང་བའོ། །
en: giving up dullness and sleep,

source: རྒོད་པ་ལས་འདས་པའོ། །
en: going beyond agitation,

source: ཐེ་ཙོམ་སྤོང་བའོ། །
en: giving up doubt,

source: འདོད་པ་ལ་འདུན་པ་སེལ་བའོ། །
en: dispelling the wish for pleasure,

source: ལེ་ལོ་ཡོངས་སུ་སྤོང་བའོ། །
en: and giving up laziness.

source: བདག་ཏུ་མི་དམིགས་པའོ། །
en: It is not observing a self,

source: སེམས་ཅན་དུ་མི་སྟོན་པའོ། །
en: not propounding the existence of a sentient being,

source: སྲོག་ལ་མི་གནས་པའོ། །
en: not fixating on a life force,

source: ཆོས་ལ་བརྗེད་ངས་པ་མེད་པའོ། །
en: being free from forgetfulness regarding the Dharma,

source: ཕྱིན་ཅི་ལོག་མེད་པའི་གཏམ་སྨྲ་བའོ། །
en: speaking flawless words,

source: རིགས་པར་སྨྲ་བའོ། །
en: speaking with reason,

source: མངོན་པར་འདུ་བྱེད་པ་ལ་ལེགས་པར་བསམས་པའོ། །
en: properly contemplating the process of formation,

source: ཅང་ཤེས་ཀྱི་ངོ་བོའོ། །
en: the essence of mastery,

source: ཞུམ་པ་མེད་པའི་ངོ་བོའོ། །
en: the essence of being undeterred,

source: སྦྱིན་པ་དང་ཡེ་ཤེས་ལ་མོས་པ་ཉིད་དོ། །
en: inspiration toward generosity and wisdom,

source: འཁོར་གྱི་ནང་དུ་ཞུམ་པ་མེད་པར་འགྲོ་བ་ཉིད་དོ། །
en: entering the retinue without timidity,

source: གཞན་ལ་མི་སྨོད་པ་ཉིད་དོ། །
en: not disparaging others,

source: རང་གི་ཡོན་ཏན་མི་བརྗོད་པའོ། །
en: not proclaiming one’s own qualities,

source: བྱང་ཆུབ་ཀྱི་ཕྱིར་རྟག་ཏུ་གནས་པའོ། །
en: and constant commitment for the sake of awakening.

source: སྦྱོར་བར་བརྩམས་པའོ། །
en: It is diligent engagement,

source: ཕྱོགས་འགའ་ལ་ཡུན་རིང་དུ་མི་གནས་པའོ། །
en: not staying for long in any location,

source: ཡོངས་སུ་འཛིན་པ་སྤོང་བའོ། །
en: giving up grasping,

source: བཀྲ་ཤིས་པར་ཡང་དག་པར་སྤྱོད་པའོ། །
en: engaging in auspicious activities,

source: ལུས་ཀྱི་ངོ་བོ་མ་ཡིན་པའོ། །
en: not being of the body,

source: སེམས་ཞུམ་པ་མེད་པ་ཉིད་དོ། །
en: an undaunted mind,

source: གནས་པ་ལ་མཁས་པའོ། །
en: expertise regarding the supports,

source: རྗེས་སུ་དྲན་པ་བསྒོམ་པའོ། །
en: cultivating recollection,

source: མི་གཡོ་ཞིང་ང་རྒྱལ་མེད་པའོ། །
en: being unswerving and free from pride,

source: རྣམ་པར་གྲོལ་བ་ཚོལ་བའོ། །
en: pursuing liberation,

source: ཐེ་ཙོམ་ངེས་པར་བྱེད་པའོ། །
en: the resolution of doubt,

source: ཚངས་པའི་གནས་པ་བསྐྱེད་པའོ། །
en: taking birth in the pure abodes,

source: བྱམས་པའི་སེམས་མཉམ་པ་ཉིད་དོ། །
en: the mind of equal love,

source: སྙིང་རྗེས་རྗེས་སུ་འཛིན་པ་ཉིད་དོ། །
en: the compassionate embrace,

source: དགའ་བས་རང་ལ་དགའ་བར་ཉམས་སུ་མྱོང་བ་ཉིད་དོ། །
en: the joyous experience of appreciating oneself,

source: བཏང་སྙོམས་པ་ན་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སེལ་བའོ། །
en: dispelling attachment and anger within impartiality,

source: ཚུལ་ཁྲིམས་ཀྱིས་གཞན་རྗེས་སུ་འཛིན་པའོ། །
en: accepting others through discipline,

source: ཏིང་ངེ་འཛིན་བསྒྲུབ་པ་ལ་འཇུག་པའོ། །
en: entering the attainment of absorption,

source: ཆོས་ཐམས་ཅད་ལ་ཤེས་རབ་ཀྱིས་རྣམ་པར་གྲོལ་བར་འཇུག་པའོ། །
en: and entering the liberation of all factors through insight.

source: ཡི་གེ་བསྒྲུབ་པ་ཁོང་དུ་ཆུད་པའོ། །
en: It is understanding the use of syllables,

source: བརྗོད་པ་རྟོགས་པའོ། །
en: mastering expressions,

source: སྒྲ་ལ་འཇུག་པའོ། །
en: engaging with language,

source: མཁས་པའི་ངོ་བོ་དོན་དུ་གཉེར་བ་ཉིད་དོ། །
en: pursuit of the essence of expertise,

source: འདོད་པ་མེད་པར་ཆོས་ཀྱི་སྦྱིན་པ་རབ་ཏུ་སྒྲོགས་པ་ཉིད་དོ། །
en: and expressing the gift of Dharma without vested desires.

source: བློ་གཅིག་ཏུ་ངེས་པ་ལ་མངོན་པར་དགའ་བ་མེད་པའོ། །
en: It is having no zeal for single-minded certainty,

source: ཚུལ་གཅིག་པ་ལ་ཡོངས་སུ་སྐྱོ་བ་མེད་པའོ། །
en: not growing tired of a single approach,

source: བྱང་ཆུབ་ལ་བླང་དོར་མེད་པའོ། །
en: neither accepting nor rejecting what concerns awakening,

source: ཆོས་ཐམས་ཅད་ལ་ཆུད་ཟ་བ་མེད་པའོ། །
en: not squandering any dharma,

source: ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་སྟོན་པའོ། །
en: teaching correctly,

source: སེམས་ཅན་ཐམས་ཅད་ལ་སླུ་བ་མེད་པ་ཉིད་དོ། །
en: and not deceiving any sentient being.

source: སྨོན་ལམ་བརྟན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །
en: It is the perfection of stable aspiration,

source: ཉིན་མཚན་དུ་སྦྱོར་བ་ལ་རྒྱུན་ཆད་པ་མེད་པའོ། །
en: continuous engagement throughout day and night,

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའོ། །
en: the conduct of the bodhisattvas,

source: སེམས་ཅན་གྱི་ཁམས་ལ་འཇུག་པའོ། །
en: entering the realms of sentient beings,

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་བསྒྲུབ་པ་སྟེ།
en: and accomplishing omniscience.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་ངེས་པར་སྟོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ། །
en: Prāmodyarāja, this is the absorption that is known as elucidating the way of all phenomena.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: At that time, the Blessed One spoke these verses:

source: སྤྱོད་པ་དག་བྱེད་འཕགས་པ་རྣམས་ཀྱི་ལམ། །
en: “The path of the noble ones that purifies conduct,

source: རྗེས་སུ་འཐུན་པའི་ཚུལ་ཡིན་སེམས་སྦྱངས་པ། །
en: The way of harmony that refines the mind,

source: སྤོབས་པའི་སྙིང་པོ་བྱང་ཆུབ་ཡན་ལག་ཚུལ། །
en: And the way of the branches of awakening, the essence of eloquence—

source: ཏིང་འཛིན་འདི་ནི་བདེ་བར་གཤེགས་པའི་ནོར། །
en: This absorption is the treasure of the well-gone ones.

source: བདུད་འདུལ་དྲི་བྲལ་ཁོ་ནས་ཁྲོ་བ་སྤངས། །
en: “Stainless subduer of the māras that alone eliminates anger,

source: སྲིད་པའི་སྲེད་པ་གཅོད་བྱེད་ཤེས་རབ་དང་། །
en: Insight that severs the craving for existence,

source: སྙན་དང་གྲགས་པའི་ཡོན་ཏན་ལེགས་འབྱོར་ཅིང་། །
en: Perfectly granting the qualities of fame and renown,

source: ཁམས་གསུམ་དག་ལས་ངེས་འབྱུང་མཐར་ཡང་ཕྱིན། །
en: Final deliverance from the three realms,

source: ཡེ་ཤེས་ས་ཡིན་དགེ་བའི་ལམ་ཡང་ཡིན། །
en: “It is the ground of wisdom and is also the path of virtue.

source: འཕགས་པའི་རིགས་ཡིན་བདུད་རྣམས་ཕུང་བྱེད་པ། །
en: It is the family of the noble ones, the destroyer of māras,

source: སྲིད་ལས་ཐར་བྱེད་བདེ་བར་གཤེགས་པས་བསྟོད། །
en: The liberator from existence, praised by the well-gone ones—

source: ཤིན་ཏུ་མཉམ་འཇུག་ཚུལ་ནི་བྱེ་བའི་སྒོ། །
en: “The gate to ten million ways of entering perfect equality,

source: རྗེས་སུ་རྟོགས་བྱེད་ཚིམ་བྱེད་གཅོད་བྱེད་ཅིང་། །
en: The source of understanding, satisfaction, and severance,

source: སྡུག་བསྔལ་བཅོམ་པ་བདེ་བའི་རྗེས་འཇུག་པ། །
en: Destroyer of suffering and harbinger of happiness—

source: ཏིང་འཛིན་འདི་ནི་བདེ་གཤེགས་སྤྱོད་པ་ཡིན། །
en: This absorption is the conduct of the well-gone ones.

source: བྱང་ཆུབ་ཡན་ལག་མེ་ཏོག་དྲན་རྟོགས་བྱེད། །
en: “Making us recollect and understand the flower of the branches of awakening;

source: ངོ་ཚ་ཤེས་པར་ལེགས་གནས་དགེ་བ་བསྡུས། །
en: Amassing virtue, the excellent foundation, with a sense of modesty;

source: བྱང་ཆུབ་ཡན་ལག་ཕྲེང་བ་བདེ་གཤེགས་དགྱེས། །
en: Delighting the well-gone ones with garlands of the branches of awakening—

source: ཏིང་འཛིན་མཆོག་དེ་འདི་ནི་གསུངས་པ་ཡིན། །
en: This is the supreme absorption that is taught.

source: བྱང་ཆུབ་ཡན་ལག་ཕྲེང་བ་རྣམ་ཐར་པ། །
en: “Garland of the branches of awakening, liberation;

source: རབ་ཏུ་སྐྱེ་བྱེད་ཞིང་གི་ཕ་མཐར་ཕྱིན། །
en: Conqueror of birth, culminating in the buddhafields;

source: ཟླ་བའི་འོད་བྱེད་སྣང་བྱེད་སྲིད་གསུམ་འདས། །
en: Granter of moonlight, illuminator, beyond the three realms—

source: ཆོས་མཆོག་འདི་ཀུན་ཟླ་བས་བསྟོད་པ་ཡིན། །
en: This supreme Dharma is praised by the moon.

source: སེམས་གཡེངས་ཚུལ་འཆོས་ཤེས་ཁེ་རྙེད་པ་དག །
en: “Giving up distractions, pretenses, and the worldly aims,

source: སྤངས་ནས་དགོན་པར་བསྟེན་པར་འགྱུར་བྱ་ཞིང་། །
en: Adhering to a forest retreat,

source: སྦྱོར་བ་རྣམ་གསུམ་དག་པར་འགྱུར་བྱ་ན། །
en: And purifying the three modes of engagement—

source: ཏིང་ངེ་འཛིན་འདི་ཡང་དག་བསྒྲུབ་པར་གྱིས། །
en: Thus, one shall attain this absorption.

source: ཕ་རོལ་འཆིང་དང་གཡོ་དང་ཤེས་ཁེའི་རྒྱུ། །སྤངས་ནས་
en: “Having relinquished the causes of attachments to others, deception, and profiteering,

source: རང་གི་ཡོན་ཏན་མི་རྗོད་པར། །
en: You do not proclaim your own qualities.

source: ཆོས་གོས་གསུམ་དང་བསོད་སྙོམས་སྤྱོད་པར་ཤོག །
en: May you don the three Dharma robes and live as a mendicant.

source: འདི་ལ་སྦྱོར་གྱུར་སྩོགས་འཇོག་བྱེད་མ་གྱུར། །
en: Thereby you will not engage in hoarding wealth.

source: འཕགས་པ་བགེད་པའི་ངང་ཚུལ་ལྡན་བྱ་ཞིང་། །
en: “Maintain the cheerful character of the noble ones,

source: གལ་ཏེ་ཏིང་འཛིན་མྱུར་ཐོབ་འདོད་ན་ནི། །
en: And if you wish to quickly attain absorption,

source: མཁས་པས་རྟག་ཏུ་དྲི་བ་བརྩམ་པར་གྱིས། །
en: Be wise and always ask questions.

source: དྲིས་ནས་ཡང་དག་བསྒྲུབ་ལའང་གནས་པར་གྱིས། །
en: Once you have asked, you should also adhere to realization.

source: ཚོགས་ལས་ཐག་རིང་ཞི་གནས་དགར་འགྱུར་དང་། །
en: “Remaining far from gatherings and enjoying calm abiding,

source: འགྲོ་ཀུན་ལ་ནི་མཛའ་བས་མཉེན་བྱ་ཞིང་། །
en: Being a caring friend to all beings,

source: ཚུལ་འཆོས་གཞི་ཡི་གྲགས་པ་གཞར་བཏང་ན
en: And always giving up fame, the basis for hypocrisy,

source: ཏིང་འཛིན་ཞི་བ་འདི་ནི་བཙལ་བར་གྱིས། །
en: You should pursue this peaceful absorption.

source: ངོ་ཚ་ཤེས་གོས་དབེན་པའི་རོ་ཡི་ཟས། །
en: “Dress in modesty and savor the food of solitude.

source: བསམ་གཏན་མལ་ཆ་སྟན་དང་དབེན་པའི་ཁྱིམ། །
en: Resting in concentration within your home in solitude,

source: བདག་མེད་རྟོགས་ལ་རྟག་ཏུ་དགའ་བྱེད་ན། །
en: If you take constant joy in the realization of selflessness,

source: མཁས་པ་གཞན་གྱི་བདེ་ལ་འདོད་མི་འགྱུར། །
en: You will not wish for the pleasures of other experts.

source: གལ་ཏེ་ཏིང་འཛིན་འདི་མྱུར་ཐོབ་འདོད་ན། །
en: “If you wish to quickly attain this absorption,

source: ཁྲོས་པས་སྨྲས་ན་གཞན་ལ་བཟོད་པ་དང་། །
en: Be patient when others speak with anger,

source: ང་རྒྱལ་བསྐྱེད་མི་བྱ་ཞིང་ང་བྲལ་བྱ། །
en: Do not develop pride, let go of the sense of ‘I,’

source: ལས་ཀྱི་རྣམ་པར་སྨིན་ལའང་མངོན་དད་གྱིས། །
en: And have firm faith in the ripening of karma.

source: ངན་སོང་ལམ་དང་དམིགས་ལ་མི་སྟེན་ཅིང་། །
en: “Without adhering to the paths and situations of the lower realms,

source: འཕགས་པའི་འགྲོ་བ་སྟོང་ལའང་མི་སྟེན་པར། །
en: And without adhering to places devoid of noble beings,

source: ཉིན་མཚན་བརྩོན་འགྲུས་སྟོབས་ལ་བརྩམ་བྱ་ན
en: Give rise to the power of diligence throughout day and night.

source: ཚུལ་གཞན་མིན་པའི་ཏིང་འཛིན་འདི་ཐོབ་བྱ། །
en: Thus, you must obtain this absorption—there is no other way.

source: མཐའ་གཉིས་ཡིད་འོང་མ་ཡིན་ལམ་སྤངས་པ། །
en: “Free from the unattractive paths of the two extremes,

source: ཡང་དག་ཚུལ་འདི་ལམ་ནི་མཉམ་པ་སྟེ། །
en: This true way is a path of equality.

source: མ་བྱས་སྐྱེ་མེད་ཆོས་ནི་སུས་མཐོང་བ། །
en: Whoever sees this uncreated and unborn Dharma

source: བསྒྲུབ་པ་འདི་ལ་སངས་རྒྱས་དགྱེས་པར་འགྱུར། །
en: Will delight the buddhas with their accomplishment.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་ངེས་པར་སྟོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་སྟེ།
en: “Prāmodyarāja, such is the absorption known as elucidating the way of all phenomena.

source: དེ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་ཆོས་ཐམས་ཅད་ཕྱིན་ཅི་མ་ལོག་པ་ཉིད་དུ་རྟོགས་སོ། །
en: Bodhisattvas who attain it comprehend all phenomena without error.

source: ཆོས་ཐམས་ཅད་མི་གནས་པར་རྟོགས་སོ། །
en: They realize that all phenomena are unsupported.

source: ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པར་རྟོགས་སོ། །
en: They realize all phenomena to be unborn.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་བྱས་པ་མེད་པར་རྟོགས་སོ། །
en: They realize all phenomena of the buddhas to be uncreated.

source: ཆོས་ཐམས་ཅད་གསོག་ཏུ་རྟོགས་སོ། །
en: They realize all phenomena to be hollow.

source: ཆོས་ཐམས་ཅད་གསོབ་ཏུ་རྟོགས་སོ། །
en: They realize all phenomena to be fake.

source: ཆོས་ཐམས་ཅད་སྙིང་པོ་མེད་པར་རྟོགས་སོ། །
en: They realize all phenomena to be devoid of any essence.

source: གཞན་གྱིས་ཟིལ་གྱིས་མི་ནོན་ཏོ། །
en: They become indomitable.

source: འགྲོ་བ་ལྔ་ལས་རྒལ་ཏོ། །
en: They go beyond the five realms of wandering beings.

source: བདུད་རླག་པར་བྱེད་དོ། །
en: They defeat the māras.

source: སེམས་ཅན་ཐམས་ཅད་དགའ་བར་འགྱུར་རོ། །
en: They bring joy to all sentient beings.

source: མཁས་པ་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་ཡིན་ནོ། །
en: They receive the veneration of all the learned.

source: ཆོས་ཉིད་ཐམས་ཅད་མཐོང་ངོ་། །
en: They behold the whole nature of reality.

source: ཟླ་བ་ལྟར་ལྷང་ངེར་སྣང་ངོ་། །
en: They shine brightly like the moon.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུ་བ་རབ་ཏུ་ཤེས་སོ། །
en: They know the movements in the minds of all sentient beings.

source: བསམ་པ་དག་པ་རྣམས་ལ་སྐུལ་མ་འདེབས་པ་ཡིན་ནོ། །
en: They inspire everyone with pure intention.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཤེས་པ་ཡིན་ནོ། །
en: They know the whole trichiliocosm.

source: སྤྱོད་པའི་ས་རྗེས་སུ་ཐོབ་བོ། །
en: They attain the level of devoted conduct.

source: བདག་མེད་པ་ཉིད་ལ་འཇུག་གོ། །
en: “They delve into selflessness.

source: ངེས་པར་འབྱུང་བར་བྱ་བའི་ཁམས་རབ་ཏུ་ཤེས་སོ། །
en: They comprehend the elements that are to be left behind.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་མངོན་པའི་ང་རྒྱལ་མེད་པའི་ས་རྗེས་སུ་ཐོབ་བོ། །
en: They attain the spiritual level that transcends the arrogating pride of all sentient beings.

source: སྒྲིབ་པ་ལས་འདས་སོ། །
en: They transcend obscuration.

source: མིང་དང་གཟུགས་ཀྱི་རང་བཞིན་རབ་ཏུ་ཤེས་སོ། །
en: They comprehend the nature of name and form.

source: ངེས་པའི་ཚིག་གི་སྒོ་ནས་སངས་རྒྱས་རྣམས་ཀྱིས་བསྟན་པ་རྗེས་སུ་རྟོགས་སོ། །
en: They reflect on the teaching of the buddhas in terms of creative etymologies.

source: མཚན་སུམ་ཅུ་རྩ་གཉིས་རབ་ཏུ་ཐོབ་བོ། །
en: They attain the thirty-two marks.

source: རྙེད་པ་དང་མ་རྙེད་པས་གཏུགས་པ་ལས་འདས་སོ། །
en: They are unaffected by acquisition and lack of acquisition.

source: འཇིག་རྟེན་ན་གོས་པ་མེད་པ་ཉིད་ཐོབ་བོ། །
en: They are unpolluted within the world.

source: སེམས་ཅན་རྣམས་ཀྱི་གནས་ཡིན་ནོ། །
en: They are a support for all sentient beings.

source: མྱ་ངན་ལས་འདས་པའི་སྒོ་འབྱེད་དོ། །
en: They open the door to nirvāṇa.

source: སྦྱིན་པ་པོ་ཡིན་ནོ། །
en: They are donors.

source: འཆི་བ་མེད་པར་སྟོན་པ་ཡིན་ནོ། །
en: They reveal deathlessness.

source: མྱ་ངན་ལས་འདས་པ་ཁོང་དུ་ཆུད་པ་ཡིན་ནོ། །
en: They comprehend nirvāṇa.

source: སེམས་ཅན་རྣམས་ཀྱི་གདུང་བ་སེལ་ཏོ། །
en: They dispel the torments of sentient beings.

source: སེམས་ཅན་རྣམས་ཀྱི་ཐེ་ཙོམ་གཅོད་པ་ཡིན་ནོ། །
en: They cut through the doubts of sentient beings.

source: དབང་པོ་དྲུག་པོ་དག་གིས་མི་གོས་པ་ཡིན་ནོ། །
en: They are not adulterated by the six faculties.

source: ཡི་གེའི་སྒོ་བཅུ་དྲུག་ལ་འཇུག་པའི་གཟུངས་ཐོབ་བོ། །
en: They attain the retention of engaging in the sixteen syllables.

source: ཡི་གེ་བཅུ་དྲུག་འཐོབ་པ་གང་ཞེ་ན།
en: Which are the sixteen syllables they attain the retention of engaging in?

source: ཨ་ཞེས་བྱ་བ་དང་། ར་ཞེས་བྱ་བ་དང་། པ་ཞེས་བྱ་བ་དང་། ཙ་ཞེས་བྱ་བ་དང་། ན་ཞེས་བྱ་བ་དང་། ད་ཞེས་བྱ་བ་དང་། ས་ཞེས་བྱ་བ་དང་། ཀ་ཞེས་བྱ་བ་དང་། ཐ་ཞེས་བྱ་བ་དང་། པ་ཞེས་བྱ་བ་དང་། བ་ཞེས་བྱ་བ་དང་། ཀྴ་ཞེས་བྱ་བ་དང་། ཚ་ཞེས་བྱ་བ་དང་། པ་ཞེས་བྱ་བ་དང་། ཋ་ཞེས་བྱ་བ་དང་། ཌྷ་ཞེས་བྱ་བ་སྟེ། འདི་དག་ནི་བཅུ་དྲུག་གོ། །
en: They are a, ra, pa, ca, na, da, sa, ka, tha, pa, ba, kṣa, cha, pa, ṭha, and ḍha.

source: རྣམ་པ་བཅུ་དྲུག་ལ་འཇུག་པའི་གཟུངས་ལས་ནི་མཐའ་ཡས་པས་བསྒྲུབ་པའི་ས་ཡང་ཐོབ་བོ། །
en: By means of the retention of engaging in these sixteen, they attain the spiritual level of accomplishment in infinite ways.

source: ཆོས་ཐམས་ཅད་ཡ་མ་བརླར་རབ་ཏུ་ཤེས་སོ། །
en: “They comprehend the voidness of all phenomena.

source: ངེས་པར་བྱེད་དོ། །
en: They gain certainty.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཤེས་པ་དག་སྐྱེད་པར་བྱེད་དོ། །
en: They develop knowledge of the intentions of all sentient beings.

source: དེ་ལ་ཉོན་མོངས་པ་ཐམས་ཅད་ཡོད་པ་མ་ཡིན་ནོ། །
en: In this way, all emotional defilements cease to exist.

source: བྱིས་པ་ཐམས་ཅད་ཀྱིས་གཟུང་བའི་ཆོས་དེ་ཁོ་ན་རབ་ཏུ་ཤེས་སོ། །
en: They understand the true nature of everything grasped by immature beings.

source: འཇུག་པར་བྱེད་དོ། །
en: They make headway.

source: སེམས་ཅན་རྣམས་ཚིམ་པར་བྱེད་དོ། །
en: They satisfy all sentient beings.

source: ལེགས་པར་སྨྲས་པས་མཆོད་སྦྱིན་བྱེད་དོ། །
en: They offer worship by means of excellent speech.

source: འཆི་བ་མེད་པའི་མཆོད་སྦྱིན་ཉེ་བར་འཇོག་གོ། །
en: They provide the offering of deathlessness.

source: སངས་རྒྱས་ཀྱི་མཛད་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བྱེད་དོ། །
en: They know all the deeds of the buddhas.

source: ཡོངས་སུ་ཤེས་པ་རྗེས་སུ་འཐོབ་བོ། །
en: They attain full knowledge.

source: བདག་དང་གཞན་གྱི་སོམ་ཉི་གཅོད་དོ། །
en: They cut through doubts in themselves and others.

source: སེམས་ཅན་རྣམས་ཀྱི་འགྱོད་པ་བསལ་བར་ཡི་དམ་བླངས་པའོ། །
en: They are always eager to dispel the regrets of sentient beings.
